01  WS-AREA-1 PIC X(100). 
01  WS-AREA-2 PIC X(100). 

PROCEDURE DIVISION.
    MOVE SPACES TO WS-AREA-1 WS-AREA-2.
    PERFORM VARYING I FROM 1 BY 1 UNTIL I > 100 
       MOVE 'A' TO WS-AREA-1(I:1) 
       MOVE 'B' TO WS-AREA-2(I:1) 
    END-PERFORM.
    DISPLAY WS-AREA-1 WS-AREA-2.
    STOP RUN.